import React, { memo } from "react";
import cl from "./PayTextContainer.module.scss";
import { useNavigate } from "react-router-dom";
import translation from "../../../../functions/translate";
const PayTextContainer = ({...props}) => {
  const navigate = useNavigate()
  const clickHandler = () => {  
    navigate("/WalletInit")
  }
  return (
    <div {...props} className={cl.textContainer}>
      <div className={cl.one}>
        <p>
          {translation("Что такое ")}<span>{translation("кошелек")}</span>{translation(" и для чего он нужен?")}
        </p>
        <svg
          width="13"
          height="14"
          viewBox="0 0 13 14"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M6.83285 6.96519C6.83285 6.68905 6.60899 6.46519 6.33285 6.46519C6.05671 6.46519 5.83285 6.68905 5.83285 6.96519H6.83285ZM5.83285 9.58659C5.83285 9.86273 6.05671 10.0866 6.33285 10.0866C6.60899 10.0866 6.83285 9.86273 6.83285 9.58659H5.83285ZM6.23203 4.84791V4.34791C5.95589 4.34791 5.73203 4.57176 5.73203 4.84791H6.23203ZM6.23203 5.04955H5.73203C5.73203 5.32569 5.95589 5.54955 6.23203 5.54955V5.04955ZM6.43367 5.04955V5.54955C6.70982 5.54955 6.93367 5.32569 6.93367 5.04955H6.43367ZM6.43367 4.84791H6.93367C6.93367 4.57176 6.70982 4.34791 6.43367 4.34791V4.84791ZM11.5798 7.16684C11.5798 10.0646 9.23064 12.4137 6.33285 12.4137V13.4137C9.78293 13.4137 12.5798 10.6169 12.5798 7.16684H11.5798ZM6.33285 12.4137C3.43506 12.4137 1.08594 10.0646 1.08594 7.16684H0.0859375C0.0859375 10.6169 2.88278 13.4137 6.33285 13.4137V12.4137ZM1.08594 7.16684C1.08594 4.26905 3.43506 1.91992 6.33285 1.91992V0.919922C2.88278 0.919922 0.0859375 3.71676 0.0859375 7.16684H1.08594ZM6.33285 1.91992C9.23064 1.91992 11.5798 4.26905 11.5798 7.16684H12.5798C12.5798 3.71676 9.78293 0.919922 6.33285 0.919922V1.91992ZM5.83285 6.96519V9.58659H6.83285V6.96519H5.83285ZM5.73203 4.84791V5.04955H6.73203V4.84791H5.73203ZM6.23203 5.54955H6.43367V4.54955H6.23203V5.54955ZM6.93367 5.04955V4.84791H5.93367V5.04955H6.93367ZM6.43367 4.34791H6.23203V5.34791H6.43367V4.34791Z"
            fill="#62BBFF"
          />
        </svg>
      </div>
      <p>
         {translation("Уже есть кошелек?")} <span onClick={clickHandler}>{translation("Войти")}</span>
      </p>
    </div>
  );
};

export default memo(PayTextContainer);
